zevorn/qemu/hw/char/stm32g474_usart.c
/*
 * STM32G474 USART and UART
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "chardev/char-serial.h"
#include "hw/char/stm32g474_usart.h"
#include "hw/core/registerfields.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h"
#include "migration/vmstate.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "system/runstate.h"

REG32(CR1, 0x00)
    FIELD(CR1, RXFFIE, 31, 1)
    FIELD(CR1, TXFEIE, 30, 1)
    FIELD(CR1, FIFOEN, 29, 1)
    FIELD(CR1, M1, 28, 1)
    FIELD(CR1, EOBIE, 27, 1)
    FIELD(CR1, RTOIE, 26, 1)
    FIELD(CR1, DEAT, 21, 5)
    FIELD(CR1, DEDT, 16, 5)
    FIELD(CR1, OVER8, 15, 1)
    FIELD(CR1, CMIE, 14, 1)
    FIELD(CR1, MME, 13, 1)
    FIELD(CR1, M0, 12, 1)
    FIELD(CR1, WAKE, 11, 1)
    FIELD(CR1, PCE, 10, 1)
    FIELD(CR1, PS, 9, 1)
    FIELD(CR1, PEIE, 8, 1)
    FIELD(CR1, TXEIE, 7, 1)
    FIELD(CR1, TCIE, 6, 1)
    FIELD(CR1, RXNEIE, 5, 1)
    FIELD(CR1, IDLEIE, 4, 1)
    FIELD(CR1, TE, 3, 1)
    FIELD(CR1, RE, 2, 1)
    FIELD(CR1, UESM, 1, 1)
    FIELD(CR1, UE, 0, 1)
REG32(CR2, 0x04)
    FIELD(CR2, ADD, 24, 8)
    FIELD(CR2, RTOEN, 23, 1)
    FIELD(CR2, ABRMOD, 21, 2)
    FIELD(CR2, ABREN, 20, 1)
    FIELD(CR2, MSBFIRST, 19, 1)
    FIELD(CR2, DATAINV, 18, 1)
    FIELD(CR2, TXINV, 17, 1)
    FIELD(CR2, RXINV, 16, 1)
    FIELD(CR2, SWAP, 15, 1)
    FIELD(CR2, LINEN, 14, 1)
    FIELD(CR2, STOP, 12, 2)
    FIELD(CR2, CLKEN, 11, 1)
    FIELD(CR2, CPOL, 10, 1)
    FIELD(CR2, CPHA, 9, 1)
    FIELD(CR2, LBCL, 8, 1)
    FIELD(CR2, LBDIE, 6, 1)
    FIELD(CR2, LBDL, 5, 1)
    FIELD(CR2, ADDM7, 4, 1)
    FIELD(CR2, DIS_NSS, 3, 1)
    FIELD(CR2, SLVEN, 0, 1)
REG32(CR3, 0x08)
    FIELD(CR3, TXFTCFG, 29, 3)
    FIELD(CR3, RXFTIE, 28, 1)
    FIELD(CR3, RXFTCFG, 25, 3)
    FIELD(CR3, TCBGTIE, 24, 1)
    FIELD(CR3, TXFTIE, 23, 1)
    FIELD(CR3, WUFIE, 22, 1)
    FIELD(CR3, WUS, 20, 2)
    FIELD(CR3, SCARCNT, 17, 3)
    FIELD(CR3, DEP, 15, 1)
    FIELD(CR3, DEM, 14, 1)
    FIELD(CR3, DDRE, 13, 1)
    FIELD(CR3, OVRDIS, 12, 1)
    FIELD(CR3, ONEBIT, 11, 1)
    FIELD(CR3, CTSIE, 10, 1)
    FIELD(CR3, CTSE, 9, 1)
    FIELD(CR3, RTSE, 8, 1)
    FIELD(CR3, DMAT, 7, 1)
    FIELD(CR3, DMAR, 6, 1)
    FIELD(CR3, SCEN, 5, 1)
    FIELD(CR3, NACK, 4, 1)
    FIELD(CR3, HDSEL, 3, 1)
    FIELD(CR3, IRLP, 2, 1)
    FIELD(CR3, IREN, 1, 1)
    FIELD(CR3, EIE, 0, 1)
REG32(BRR, 0x0c)
    FIELD(BRR, BRR, 0, 16)
REG32(GTPR, 0x10)
    FIELD(GTPR, GT, 8, 8)
    FIELD(GTPR, PSC, 0, 8)
REG32(RTOR, 0x14)
    FIELD(RTOR, BLEN, 24, 8)
    FIELD(RTOR, RTO, 0, 24)
REG32(RQR, 0x18)
    FIELD(RQR, TXFRQ, 4, 1)
    FIELD(RQR, RXFRQ, 3, 1)
    FIELD(RQR, MMRQ, 2, 1)
    FIELD(RQR, SBKRQ, 1, 1)
    FIELD(RQR, ABRRQ, 0, 1)
REG32(ISR, 0x1c)
    FIELD(ISR, TXFT, 27, 1)
    FIELD(ISR, RXFT, 26, 1)
    FIELD(ISR, TCBGT, 25, 1)
    FIELD(ISR, RXFF, 24, 1)
    FIELD(ISR, TXFE, 23, 1)
    FIELD(ISR, REACK, 22, 1)
    FIELD(ISR, TEACK, 21, 1)
    FIELD(ISR, WUF, 20, 1)
    FIELD(ISR, RWU, 19, 1)
    FIELD(ISR, SBKF, 18, 1)
    FIELD(ISR, CMF, 17, 1)
    FIELD(ISR, BUSY, 16, 1)
    FIELD(ISR, ABRF, 15, 1)
    FIELD(ISR, ABRE, 14, 1)
    FIELD(ISR, UDR, 13, 1)
    FIELD(ISR, EOBF, 12, 1)
    FIELD(ISR, RTOF, 11, 1)
    FIELD(ISR, CTS, 10, 1)
    FIELD(ISR, CTSIF, 9, 1)
    FIELD(ISR, LBDF, 8, 1)
    FIELD(ISR, TXE, 7, 1)
    FIELD(ISR, TC, 6, 1)
    FIELD(ISR, RXNE, 5, 1)
    FIELD(ISR, IDLE, 4, 1)
    FIELD(ISR, ORE, 3, 1)
    FIELD(ISR, NE, 2, 1)
    FIELD(ISR, FE, 1, 1)
    FIELD(ISR, PE, 0, 1)
REG32(ICR, 0x20)
    FIELD(ICR, WUCF, 20, 1)
    FIELD(ICR, CMCF, 17, 1)
    FIELD(ICR, UDRCF, 13, 1)
    FIELD(ICR, EOBCF, 12, 1)
    FIELD(ICR, RTOCF, 11, 1)
    FIELD(ICR, CTSCF, 9, 1)
    FIELD(ICR, LBDCF, 8, 1)
    FIELD(ICR, TCBGTCF, 7, 1)
    FIELD(ICR, TCCF, 6, 1)
    FIELD(ICR, TXFECF, 5, 1)
    FIELD(ICR, IDLECF, 4, 1)
    FIELD(ICR, ORECF, 3, 1)
    FIELD(ICR, NECF, 2, 1)
    FIELD(ICR, FECF, 1, 1)
    FIELD(ICR, PECF, 0, 1)
REG32(RDR, 0x24)
    FIELD(RDR, RDR, 0, 9)
REG32(TDR, 0x28)
    FIELD(TDR, TDR, 0, 9)
REG32(PRESC, 0x2c)
    FIELD(PRESC, PRESCALER, 0, 4)

#define STM32G474_USART_MMIO_SIZE 0x400
#define STM32G474_USART_ISR_RESET (R_ISR_TXE_MASK | R_ISR_TC_MASK)
#define STM32G474_USART_U_ISR_VALID_MASK 0x027fffff
#define STM32G474_USART_A_ISR_VALID_MASK 0x007fcfff
#define STM32G474_USART_CR1_FIFO_MASK \
    (R_CR1_RXFFIE_MASK | R_CR1_TXFEIE_MASK | R_CR1_FIFOEN_MASK)
#define STM32G474_USART_CR3_FIFO_MASK \
    (R_CR3_TXFTCFG_MASK | R_CR3_RXFTIE_MASK | R_CR3_RXFTCFG_MASK | \
     R_CR3_TXFTIE_MASK)

struct Stm32g474UsartVariant {
    const char *name;
    const RegisterAccessInfo *regs_info;
    size_t num_regs;
    uint32_t isr_valid_mask;
    bool is_usart;
};

#define STM32G474_USART_CR1_LOCKED_MASK \
    (R_CR1_FIFOEN_MASK | R_CR1_M1_MASK | R_CR1_DEAT_MASK | \
     R_CR1_DEDT_MASK | R_CR1_OVER8_MASK | R_CR1_M0_MASK | \
     R_CR1_WAKE_MASK | R_CR1_PCE_MASK | R_CR1_PS_MASK)
#define STM32G474_USART_CR2_UE_LOCKED_MASK \
    (R_CR2_MSBFIRST_MASK | R_CR2_DATAINV_MASK | R_CR2_TXINV_MASK | \
     R_CR2_RXINV_MASK | R_CR2_SWAP_MASK | R_CR2_LINEN_MASK | \
     R_CR2_STOP_MASK | R_CR2_CLKEN_MASK | R_CR2_CPOL_MASK | \
     R_CR2_CPHA_MASK | R_CR2_LBCL_MASK | R_CR2_LBDL_MASK | \
     R_CR2_ADDM7_MASK)
#define STM32G474_USART_CR2_TE_LOCKED_MASK \
    (R_CR2_CPOL_MASK | R_CR2_CPHA_MASK | R_CR2_LBCL_MASK)
#define STM32G474_USART_CR3_UE_LOCKED_MASK \
    (R_CR3_WUS_MASK | R_CR3_DEP_MASK | R_CR3_DEM_MASK | \
     R_CR3_DDRE_MASK | R_CR3_OVRDIS_MASK | R_CR3_ONEBIT_MASK | \
     R_CR3_CTSE_MASK | R_CR3_RTSE_MASK | R_CR3_SCEN_MASK | \
     R_CR3_NACK_MASK | R_CR3_HDSEL_MASK | R_CR3_IRLP_MASK | \
     R_CR3_IREN_MASK)
#define STM32G474_USART_ISR_FIFO_MASK \
    (R_ISR_TXFT_MASK | R_ISR_RXFT_MASK | R_ISR_RXFF_MASK | \
     R_ISR_TXFE_MASK)
#define STM32G474_USART_COMMON_CR1_UNIMP_MASK \
    (STM32G474_USART_CR1_FIFO_MASK | R_CR1_DEAT_MASK | \
     R_CR1_DEDT_MASK | R_CR1_RTOIE_MASK | R_CR1_CMIE_MASK | \
     R_CR1_MME_MASK | R_CR1_WAKE_MASK | R_CR1_PEIE_MASK | \
     R_CR1_IDLEIE_MASK | R_CR1_UESM_MASK)
#define STM32G474_USART_COMMON_ISR_MODELED_MASK \
    (R_ISR_REACK_MASK | R_ISR_TEACK_MASK | R_ISR_WUF_MASK | \
     R_ISR_CMF_MASK | R_ISR_RTOF_MASK | R_ISR_CTSIF_MASK | \
     R_ISR_LBDF_MASK | R_ISR_TXE_MASK | R_ISR_TC_MASK | \
     R_ISR_RXNE_MASK | R_ISR_IDLE_MASK | R_ISR_ORE_MASK | \
     R_ISR_NE_MASK | R_ISR_FE_MASK | R_ISR_PE_MASK)
#define STM32G474_USART_U_ISR_MODELED_MASK \
    (STM32G474_USART_COMMON_ISR_MODELED_MASK | R_ISR_TCBGT_MASK | \
     R_ISR_UDR_MASK | R_ISR_EOBF_MASK)

static const uint16_t stm32g474_usart_prescalers[] = {
    1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256,
};

static const Stm32g474UsartVariant *
stm32g474_usart_get_variant(Stm32g474UsartState *s)
{
    return STM32G474_USART_BASE_GET_CLASS(s)->variant;
}

