zevorn/qemu/hw/char/stm32g474_usart.c
static bool stm32g474_usart_in_reset(Stm32g474UsartState *s)
{
    return s->resetting || s->peripheral_reset_asserted;
}

static void stm32g474_usart_cancel_tx_watch(Stm32g474UsartState *s)
{
    g_clear_handle_id(&s->watch_tag, g_source_remove);
}

static void stm32g474_usart_cancel_resume(Stm32g474UsartState *s)
{
    if (s->resume_entry) {
        qemu_del_vm_change_state_handler(s->resume_entry);
        s->resume_entry = NULL;
    }
}

static void stm32g474_usart_update_irq(Stm32g474UsartState *s)
{
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);
    uint32_t cr1 = s->regs[R_CR1];
    uint32_t cr2 = s->regs[R_CR2];
    uint32_t cr3 = s->regs[R_CR3];
    uint32_t isr = s->regs[R_ISR];
    bool level;

    if (s->host_io_blocked) {
        return;
    }

    if (stm32g474_usart_in_reset(s)) {
        qemu_set_irq(s->irq, 0);
        return;
    }

    level = ((isr & R_ISR_PE_MASK) && (cr1 & R_CR1_PEIE_MASK)) ||
            ((isr & R_ISR_IDLE_MASK) && (cr1 & R_CR1_IDLEIE_MASK)) ||
            ((isr & R_ISR_RXNE_MASK) && (cr1 & R_CR1_RXNEIE_MASK)) ||
            ((isr & R_ISR_TC_MASK) && (cr1 & R_CR1_TCIE_MASK)) ||
            ((isr & R_ISR_TXE_MASK) && (cr1 & R_CR1_TXEIE_MASK)) ||
            ((isr & R_ISR_ORE_MASK) &&
             ((cr1 & R_CR1_RXNEIE_MASK) || (cr3 & R_CR3_EIE_MASK))) ||
            (((isr & R_ISR_FE_MASK) || (isr & R_ISR_NE_MASK)) &&
             (cr3 & R_CR3_EIE_MASK)) ||
            ((isr & R_ISR_LBDF_MASK) && (cr2 & R_CR2_LBDIE_MASK)) ||
            ((isr & R_ISR_CTSIF_MASK) && (cr3 & R_CR3_CTSIE_MASK)) ||
            ((isr & R_ISR_RTOF_MASK) && (cr1 & R_CR1_RTOIE_MASK)) ||
            ((isr & R_ISR_CMF_MASK) && (cr1 & R_CR1_CMIE_MASK)) ||
            ((isr & R_ISR_WUF_MASK) && (cr3 & R_CR3_WUFIE_MASK));

    if (variant->is_usart) {
        level = level ||
                ((isr & R_ISR_EOBF_MASK) &&
                 (cr1 & R_CR1_EOBIE_MASK)) ||
                ((isr & R_ISR_UDR_MASK) &&
                 (cr3 & R_CR3_EIE_MASK)) ||
                ((isr & R_ISR_TCBGT_MASK) &&
                 (cr3 & R_CR3_TCBGTIE_MASK));
    }

    qemu_set_irq(s->irq, level);
}

static int stm32g474_usart_can_receive(void *opaque)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);
    uint32_t cr1 = s->regs[R_CR1];

    return s->handlers_installed &&
           !s->host_io_blocked &&
           !stm32g474_usart_in_reset(s) &&
           clock_get_hz(s->clk) != 0 &&
           (cr1 & R_CR1_UE_MASK) &&
           (cr1 & R_CR1_RE_MASK) &&
           !(s->regs[R_ISR] & R_ISR_RXNE_MASK);
}

static void stm32g474_usart_accept_input(Stm32g474UsartState *s)
{
    if (qemu_chr_fe_backend_connected(&s->chr) &&
        stm32g474_usart_can_receive(s)) {
        qemu_chr_fe_accept_input(&s->chr);
    }
}

static void stm32g474_usart_receive(void *opaque, const uint8_t *buf,
                                    int size)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);

    if (size <= 0 || !s->handlers_installed || s->host_io_blocked ||
        stm32g474_usart_in_reset(s) ||
        clock_get_hz(s->clk) == 0 ||
        !(s->regs[R_CR1] & R_CR1_UE_MASK) ||
        !(s->regs[R_CR1] & R_CR1_RE_MASK)) {
        return;
    }

    if (s->regs[R_ISR] & R_ISR_RXNE_MASK) {
        if (s->regs[R_CR3] & R_CR3_OVRDIS_MASK) {
            s->regs[R_RDR] = buf[0];
        } else {
            s->regs[R_ISR] |= R_ISR_ORE_MASK;
        }
    } else {
        s->regs[R_RDR] = buf[0];
        s->regs[R_ISR] |= R_ISR_RXNE_MASK;
    }

    stm32g474_usart_update_irq(s);
}

static void stm32g474_usart_complete_tx(Stm32g474UsartState *s)
{
    s->tx_pending = false;
    s->regs[R_ISR] |= STM32G474_USART_ISR_RESET;
    stm32g474_usart_update_irq(s);
}

static gboolean stm32g474_usart_transmit_watch(void *do_not_use,
                                               GIOCondition cond,
                                               void *opaque);

static void stm32g474_usart_try_transmit(Stm32g474UsartState *s)
{
    uint8_t byte;
    int ret;

    if (!s->tx_pending || s->watch_tag || s->host_io_blocked ||
        stm32g474_usart_in_reset(s) ||
        clock_get_hz(s->clk) == 0) {
        return;
    }

    if (!(s->regs[R_CR1] & R_CR1_UE_MASK) ||
        !(s->regs[R_CR1] & R_CR1_TE_MASK)) {
        stm32g474_usart_complete_tx(s);
        return;
    }

    if (!qemu_chr_fe_backend_connected(&s->chr)) {
        stm32g474_usart_complete_tx(s);
        return;
    }

    byte = s->regs[R_TDR] & UINT8_MAX;
    ret = qemu_chr_fe_write(&s->chr, &byte, 1);
    if (ret == 1) {
        stm32g474_usart_complete_tx(s);
        return;
    }

    if (ret == 0 || (ret == -1 && errno == EAGAIN)) {
        s->watch_tag = qemu_chr_fe_add_watch(
            &s->chr, G_IO_OUT | G_IO_HUP,
            stm32g474_usart_transmit_watch, s);
        if (s->watch_tag) {
            return;
        }
    }

    stm32g474_usart_complete_tx(s);
}

static gboolean stm32g474_usart_transmit_watch(void *do_not_use,
                                               GIOCondition cond,
                                               void *opaque)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);

    s->watch_tag = 0;
    if (cond & (G_IO_HUP | G_IO_ERR | G_IO_NVAL)) {
        if (s->tx_pending && !s->host_io_blocked &&
            !stm32g474_usart_in_reset(s)) {
            stm32g474_usart_complete_tx(s);
        }
        return G_SOURCE_REMOVE;
    }

    stm32g474_usart_try_transmit(s);
    return G_SOURCE_REMOVE;
}

static void stm32g474_usart_update_params(Stm32g474UsartState *s)
{
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);
    uint32_t cr1 = s->regs[R_CR1];
    uint32_t brr = FIELD_EX32(s->regs[R_BRR], BRR, BRR);
    uint32_t presc = FIELD_EX32(s->regs[R_PRESC], PRESC, PRESCALER);
    uint32_t word_length;
    uint32_t stop;
    uint64_t clock_hz;
    uint64_t denominator;
    uint64_t speed;
    QEMUSerialSetParams params;

    if (!s->handlers_installed || s->host_io_blocked ||
        stm32g474_usart_in_reset(s) ||
        !qemu_chr_fe_backend_connected(&s->chr)) {
        return;
    }

    clock_hz = clock_get_hz(s->clk);
    if (clock_hz == 0 || brr < 0x10 ||
        presc >= ARRAY_SIZE(stm32g474_usart_prescalers)) {
        return;
    }

    word_length = (FIELD_EX32(cr1, CR1, M1) << 1) |
                  FIELD_EX32(cr1, CR1, M0);
    if (word_length == 0) {
        params.data_bits = (cr1 & R_CR1_PCE_MASK) ? 7 : 8;
    } else if (word_length == 1) {
        if (!(cr1 & R_CR1_PCE_MASK)) {
            qemu_log_mask(LOG_UNIMP,
                          TYPE_STM32G474_USART_BASE "(%s)"
                          ": 9-bit byte-stream mode is unsupported\n",
                          variant->name);
            return;
        }
        params.data_bits = 8;
    } else if (word_length == 2) {
        params.data_bits = (cr1 & R_CR1_PCE_MASK) ? 6 : 7;
    } else {
        qemu_log_mask(LOG_GUEST_ERROR,
                      TYPE_STM32G474_USART_BASE "(%s)"
                      ": invalid CR1.M word length\n",
                      variant->name);
        return;
    }

    stop = FIELD_EX32(s->regs[R_CR2], CR2, STOP);
    if (stop == 0) {
        params.stop_bits = 1;
    } else if (stop == 2) {
        params.stop_bits = 2;
    } else {
        qemu_log_mask(LOG_UNIMP,
                      TYPE_STM32G474_USART_BASE "(%s)"
                      ": fractional stop bits are unsupported\n",
                      variant->name);
        return;
    }

    if (cr1 & R_CR1_PCE_MASK) {
        params.parity = (cr1 & R_CR1_PS_MASK) ? 'O' : 'E';
    } else {
        params.parity = 'N';
    }

    if (cr1 & R_CR1_OVER8_MASK) {
        uint32_t decoded_brr;

        if (brr & BIT(3)) {
            return;
        }
        decoded_brr = (brr & 0xfff0) | ((brr & 0x7) << 1);
        denominator =
            (uint64_t)stm32g474_usart_prescalers[presc] * decoded_brr;
        speed = (clock_hz * 2) / denominator;
    } else {
        denominator =
            (uint64_t)stm32g474_usart_prescalers[presc] * brr;
        speed = clock_hz / denominator;
    }

