zevorn/qemu/hw/char/stm32g474_usart.c
    if (speed == 0 || speed > INT_MAX) {
        return;
    }

    params.speed = speed;
    qemu_chr_fe_ioctl(&s->chr, CHR_IOCTL_SERIAL_SET_PARAMS, &params);
}

static void stm32g474_usart_apply_fifo_policy(Stm32g474UsartState *s)
{
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);

    s->regs[R_CR1] &= ~STM32G474_USART_CR1_FIFO_MASK;
    s->regs[R_CR3] &= ~STM32G474_USART_CR3_FIFO_MASK;
    s->regs[R_ISR] &= ~STM32G474_USART_ISR_FIFO_MASK;
    s->regs[R_ISR] &= variant->isr_valid_mask;
}

static void stm32g474_usart_update_ack(Stm32g474UsartState *s)
{
    uint32_t cr1 = s->regs[R_CR1];

    s->regs[R_ISR] &= ~(R_ISR_TEACK_MASK | R_ISR_REACK_MASK);
    if ((cr1 & R_CR1_UE_MASK) && (cr1 & R_CR1_TE_MASK)) {
        s->regs[R_ISR] |= R_ISR_TEACK_MASK;
    }
    if ((cr1 & R_CR1_UE_MASK) && (cr1 & R_CR1_RE_MASK)) {
        s->regs[R_ISR] |= R_ISR_REACK_MASK;
    }
}

static uint64_t stm32g474_usart_cr1_pre_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    uint32_t old = s->regs[R_CR1];

    if (stm32g474_usart_in_reset(s)) {
        return old;
    }

    if (old & R_CR1_UE_MASK) {
        value = (value & ~STM32G474_USART_CR1_LOCKED_MASK) |
                (old & STM32G474_USART_CR1_LOCKED_MASK);
    }

    return value & ~STM32G474_USART_CR1_FIFO_MASK;
}

static void stm32g474_usart_cr1_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    uint32_t cr1;

    if (stm32g474_usart_in_reset(s)) {
        return;
    }

    cr1 = s->regs[R_CR1];
    if (!(cr1 & R_CR1_UE_MASK)) {
        stm32g474_usart_cancel_tx_watch(s);
        s->tx_pending = false;
        s->regs[R_ISR] = STM32G474_USART_ISR_RESET;
    } else if (!(cr1 & R_CR1_TE_MASK) && s->tx_pending) {
        stm32g474_usart_cancel_tx_watch(s);
        s->tx_pending = false;
        s->regs[R_ISR] |= STM32G474_USART_ISR_RESET;
    }

    stm32g474_usart_update_ack(s);
    stm32g474_usart_update_params(s);
    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
}

static uint64_t stm32g474_usart_cr2_pre_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    uint32_t old_cr1 = s->regs[R_CR1];
    uint32_t old = s->regs[R_CR2];
    uint32_t locked = 0;

    if (stm32g474_usart_in_reset(s)) {
        return old;
    }

    if (old_cr1 & R_CR1_UE_MASK) {
        locked |= STM32G474_USART_CR2_UE_LOCKED_MASK;
        if (old_cr1 & R_CR1_RE_MASK) {
            locked |= R_CR2_ADD_MASK;
        }
        if (old & R_CR2_ABREN_MASK) {
            locked |= R_CR2_ABRMOD_MASK;
        }
    }
    if (old_cr1 & R_CR1_TE_MASK) {
        locked |= STM32G474_USART_CR2_TE_LOCKED_MASK;
    }

    return (value & ~locked) | (old & locked);
}

static void stm32g474_usart_cr2_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s)) {
        return;
    }

    stm32g474_usart_update_params(s);
    stm32g474_usart_update_irq(s);
}

static uint64_t stm32g474_usart_cr3_pre_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);
    uint32_t old = s->regs[R_CR3];

    if (stm32g474_usart_in_reset(s)) {
        return old;
    }

    if (s->regs[R_CR1] & R_CR1_UE_MASK) {
        value = (value & ~STM32G474_USART_CR3_UE_LOCKED_MASK) |
                (old & STM32G474_USART_CR3_UE_LOCKED_MASK);
        if (variant->is_usart && (value & R_CR3_SCARCNT_MASK)) {
            value = (value & ~R_CR3_SCARCNT_MASK) |
                    (old & R_CR3_SCARCNT_MASK);
        }
    }

    return value & ~STM32G474_USART_CR3_FIFO_MASK;
}

static void stm32g474_usart_cr3_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s)) {
        return;
    }

    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
}

static uint64_t stm32g474_usart_brr_pre_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s) ||
        (s->regs[R_CR1] & R_CR1_UE_MASK)) {
        return s->regs[R_BRR];
    }

    return value;
}

static void stm32g474_usart_params_post_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (!stm32g474_usart_in_reset(s)) {
        stm32g474_usart_update_params(s);
    }
}

static uint64_t stm32g474_usart_gtpr_pre_write(RegisterInfo *reg,
                                                uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s) ||
        (s->regs[R_CR1] & R_CR1_UE_MASK)) {
        return s->regs[R_GTPR];
    }

    return value;
}

static uint64_t stm32g474_usart_rtor_pre_write(RegisterInfo *reg,
                                                uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s)) {
        return s->regs[R_RTOR];
    }

    return value;
}

static void stm32g474_usart_rqr_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    uint32_t commands = s->regs[R_RQR];

    s->regs[R_RQR] = 0;
    if (stm32g474_usart_in_reset(s)) {
        return;
    }

    if (commands & R_RQR_RXFRQ_MASK) {
        s->regs[R_ISR] &= ~R_ISR_RXNE_MASK;
    }

    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
}

static void stm32g474_usart_icr_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);
    uint32_t commands = s->regs[R_ICR];
    uint32_t clear = 0;

    s->regs[R_ICR] = 0;
    if (stm32g474_usart_in_reset(s)) {
        return;
    }

    if (commands & R_ICR_WUCF_MASK) {
        clear |= R_ISR_WUF_MASK;
    }
    if (commands & R_ICR_CMCF_MASK) {
        clear |= R_ISR_CMF_MASK;
    }
    if (variant->is_usart && (commands & R_ICR_UDRCF_MASK)) {
        clear |= R_ISR_UDR_MASK;
    }
    if (variant->is_usart && (commands & R_ICR_EOBCF_MASK)) {
        clear |= R_ISR_EOBF_MASK;
    }
    if (commands & R_ICR_RTOCF_MASK) {
        clear |= R_ISR_RTOF_MASK;
    }
    if (commands & R_ICR_CTSCF_MASK) {
        clear |= R_ISR_CTSIF_MASK;
    }
    if (commands & R_ICR_LBDCF_MASK) {
        clear |= R_ISR_LBDF_MASK;
    }
    if (variant->is_usart && (commands & R_ICR_TCBGTCF_MASK)) {
        clear |= R_ISR_TCBGT_MASK;
    }
    if (commands & R_ICR_TCCF_MASK) {
        clear |= R_ISR_TC_MASK;
    }
    if (commands & R_ICR_TXFECF_MASK) {
        clear |= R_ISR_TXFE_MASK;
    }
    if (commands & R_ICR_IDLECF_MASK) {
        clear |= R_ISR_IDLE_MASK;
    }
    if (commands & R_ICR_ORECF_MASK) {
        clear |= R_ISR_ORE_MASK;
    }
    if (commands & R_ICR_NECF_MASK) {
        clear |= R_ISR_NE_MASK;
    }
    if (commands & R_ICR_FECF_MASK) {
        clear |= R_ISR_FE_MASK;
    }
    if (commands & R_ICR_PECF_MASK) {
        clear |= R_ISR_PE_MASK;
    }

    s->regs[R_ISR] &= ~clear;
    stm32g474_usart_update_irq(s);
}

