zevorn/qemu/hw/char/stm32g474_usart.c
static uint64_t stm32g474_usart_rdr_post_read(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    value &= R_RDR_RDR_MASK;
    if (stm32g474_usart_in_reset(s)) {
        return value;
    }

    s->regs[R_ISR] &= ~R_ISR_RXNE_MASK;
    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
    return value;
}

static uint64_t stm32g474_usart_tdr_pre_write(RegisterInfo *reg,
                                               uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    s->tdr_write_accepted = false;
    if (stm32g474_usart_in_reset(s) ||
        !(s->regs[R_CR1] & R_CR1_UE_MASK) ||
        !(s->regs[R_CR1] & R_CR1_TE_MASK) ||
        !(s->regs[R_ISR] & R_ISR_TXE_MASK)) {
        return s->regs[R_TDR];
    }

    s->tdr_write_accepted = true;
    return value;
}

static void stm32g474_usart_tdr_post_write(RegisterInfo *reg,
                                            uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);
    bool accepted = s->tdr_write_accepted;

    s->tdr_write_accepted = false;
    if (!accepted || stm32g474_usart_in_reset(s)) {
        return;
    }

    s->regs[R_ISR] &= ~STM32G474_USART_ISR_RESET;
    s->tx_pending = true;
    stm32g474_usart_update_irq(s);
    if (clock_get_hz(s->clk) != 0) {
        stm32g474_usart_try_transmit(s);
    }
}

static uint64_t stm32g474_usart_presc_pre_write(RegisterInfo *reg,
                                                 uint64_t value)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(reg->opaque);

    if (stm32g474_usart_in_reset(s) ||
        (s->regs[R_CR1] & R_CR1_UE_MASK)) {
        return s->regs[R_PRESC];
    }

    if (value > 0xb) {
        value = 0xb;
    }
    return value;
}

static const RegisterAccessInfo stm32g474_usart_u_regs_info[] = {
    {
        .name = "CR1",
        .addr = A_CR1,
        .unimp = STM32G474_USART_COMMON_CR1_UNIMP_MASK |
                  R_CR1_EOBIE_MASK,
        .pre_write = stm32g474_usart_cr1_pre_write,
        .post_write = stm32g474_usart_cr1_post_write,
    }, {
        .name = "CR2",
        .addr = A_CR2,
        .rsvd = 0x00000086,
        .unimp = 0xffffff79 & ~R_CR2_STOP_MASK,
        .pre_write = stm32g474_usart_cr2_pre_write,
        .post_write = stm32g474_usart_cr2_post_write,
    }, {
        .name = "CR3",
        .addr = A_CR3,
        .rsvd = 0x00010000,
        .unimp = 0xfffeffff &
                  ~(R_CR3_OVRDIS_MASK | R_CR3_EIE_MASK),
        .pre_write = stm32g474_usart_cr3_pre_write,
        .post_write = stm32g474_usart_cr3_post_write,
    }, {
        .name = "BRR",
        .addr = A_BRR,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_usart_brr_pre_write,
        .post_write = stm32g474_usart_params_post_write,
    }, {
        .name = "GTPR",
        .addr = A_GTPR,
        .rsvd = 0xffff0000,
        .unimp = 0x0000ffff,
        .pre_write = stm32g474_usart_gtpr_pre_write,
    }, {
        .name = "RTOR",
        .addr = A_RTOR,
        .unimp = UINT32_MAX,
        .pre_write = stm32g474_usart_rtor_pre_write,
    }, {
        .name = "RQR",
        .addr = A_RQR,
        .rsvd = 0xffffffe0,
        .unimp = R_RQR_TXFRQ_MASK | R_RQR_MMRQ_MASK |
                  R_RQR_SBKRQ_MASK | R_RQR_ABRRQ_MASK,
        .post_write = stm32g474_usart_rqr_post_write,
    }, {
        .name = "ISR",
        .addr = A_ISR,
        .reset = STM32G474_USART_ISR_RESET,
        .ro = STM32G474_USART_U_ISR_VALID_MASK,
        .rsvd = 0xfd800000,
        .unimp = STM32G474_USART_U_ISR_VALID_MASK &
                  ~STM32G474_USART_U_ISR_MODELED_MASK,
    }, {
        .name = "ICR",
        .addr = A_ICR,
        .rsvd = 0xffedc400,
        .post_write = stm32g474_usart_icr_post_write,
    }, {
        .name = "RDR",
        .addr = A_RDR,
        .ro = R_RDR_RDR_MASK,
        .rsvd = 0xfffffe00,
        .post_read = stm32g474_usart_rdr_post_read,
    }, {
        .name = "TDR",
        .addr = A_TDR,
        .rsvd = 0xfffffe00,
        .pre_write = stm32g474_usart_tdr_pre_write,
        .post_write = stm32g474_usart_tdr_post_write,
    }, {
        .name = "PRESC",
        .addr = A_PRESC,
        .rsvd = 0xfffffff0,
        .pre_write = stm32g474_usart_presc_pre_write,
        .post_write = stm32g474_usart_params_post_write,
    },
};

static const RegisterAccessInfo stm32g474_usart_a_regs_info[] = {
    {
        .name = "CR1",
        .addr = A_CR1,
        .rsvd = 0x08000000,
        .unimp = STM32G474_USART_COMMON_CR1_UNIMP_MASK,
        .pre_write = stm32g474_usart_cr1_pre_write,
        .post_write = stm32g474_usart_cr1_post_write,
    }, {
        .name = "CR2",
        .addr = A_CR2,
        .rsvd = 0x00000f8f,
        .unimp = 0xfffff070 & ~R_CR2_STOP_MASK,
        .pre_write = stm32g474_usart_cr2_pre_write,
        .post_write = stm32g474_usart_cr2_post_write,
    }, {
        .name = "CR3",
        .addr = A_CR3,
        .rsvd = 0x010f0030,
        .unimp = 0xfef0ffcf &
                  ~(R_CR3_OVRDIS_MASK | R_CR3_EIE_MASK),
        .pre_write = stm32g474_usart_cr3_pre_write,
        .post_write = stm32g474_usart_cr3_post_write,
    }, {
        .name = "BRR",
        .addr = A_BRR,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_usart_brr_pre_write,
        .post_write = stm32g474_usart_params_post_write,
    }, {
        .name = "GTPR",
        .addr = A_GTPR,
        .rsvd = 0xffffff00,
        .unimp = 0x000000ff,
        .pre_write = stm32g474_usart_gtpr_pre_write,
    }, {
        .name = "RTOR",
        .addr = A_RTOR,
        .unimp = UINT32_MAX,
        .pre_write = stm32g474_usart_rtor_pre_write,
    }, {
        .name = "RQR",
        .addr = A_RQR,
        .rsvd = 0xffffffe0,
        .unimp = R_RQR_TXFRQ_MASK | R_RQR_MMRQ_MASK |
                  R_RQR_SBKRQ_MASK | R_RQR_ABRRQ_MASK,
        .post_write = stm32g474_usart_rqr_post_write,
    }, {
        .name = "ISR",
        .addr = A_ISR,
        .reset = STM32G474_USART_ISR_RESET,
        .ro = STM32G474_USART_A_ISR_VALID_MASK,
        .rsvd = 0xff803000,
        .unimp = STM32G474_USART_A_ISR_VALID_MASK &
                  ~STM32G474_USART_COMMON_ISR_MODELED_MASK,
    }, {
        .name = "ICR",
        .addr = A_ICR,
        .rsvd = 0xffedf480,
        .post_write = stm32g474_usart_icr_post_write,
    }, {
        .name = "RDR",
        .addr = A_RDR,
        .ro = R_RDR_RDR_MASK,
        .rsvd = 0xfffffe00,
        .post_read = stm32g474_usart_rdr_post_read,
    }, {
        .name = "TDR",
        .addr = A_TDR,
        .rsvd = 0xfffffe00,
        .pre_write = stm32g474_usart_tdr_pre_write,
        .post_write = stm32g474_usart_tdr_post_write,
    }, {
        .name = "PRESC",
        .addr = A_PRESC,
        .rsvd = 0xfffffff0,
        .pre_write = stm32g474_usart_presc_pre_write,
        .post_write = stm32g474_usart_params_post_write,
    },
};

static const Stm32g474UsartVariant stm32g474_usart_u_variant = {
    .name = "USART",
    .regs_info = stm32g474_usart_u_regs_info,
    .num_regs = ARRAY_SIZE(stm32g474_usart_u_regs_info),
    .isr_valid_mask = STM32G474_USART_U_ISR_VALID_MASK,
    .is_usart = true,
};

static const Stm32g474UsartVariant stm32g474_usart_a_variant = {
    .name = "UART",
    .regs_info = stm32g474_usart_a_regs_info,
    .num_regs = ARRAY_SIZE(stm32g474_usart_a_regs_info),
    .isr_valid_mask = STM32G474_USART_A_ISR_VALID_MASK,
    .is_usart = false,
};

G_STATIC_ASSERT(STM32G474_USART_NUM_REGS ==
                A_PRESC / sizeof(uint32_t) + 1);

static const MemoryRegionOps stm32g474_usart_ops = {
    .read = register_read_memory,
    .write = register_write_memory,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 4,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void stm32g474_usart_reset_registers(Stm32g474UsartState *s)
{
    for (int i = 0; i < s->reg_array->num_elements; i++) {
        register_reset(s->reg_array->r[i]);
    }
}

static void stm32g474_usart_reset_input(void *opaque, int n, int level)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);
    bool asserted = level != 0;
    bool was_resetting;

    if (asserted == s->peripheral_reset_asserted) {
        return;
    }

    s->peripheral_reset_asserted = asserted;
    if (!asserted) {
        return;
    }

    stm32g474_usart_cancel_tx_watch(s);
    was_resetting = s->resetting;
    s->resetting = true;
    s->tdr_write_accepted = false;
    stm32g474_usart_reset_registers(s);
    s->tx_pending = false;
    s->watch_tag = 0;
    s->resetting = was_resetting;
    if (!s->host_io_blocked) {
        qemu_set_irq(s->irq, 0);
    }
}

static void stm32g474_usart_reset_enter(Object *obj, ResetType type)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(obj);

