zevorn/qemu/hw/char/stm32g474_usart.c
    s->resetting = true;
    s->tdr_write_accepted = false;
    stm32g474_usart_cancel_tx_watch(s);
}

static void stm32g474_usart_reset_hold(Object *obj, ResetType type)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(obj);

    stm32g474_usart_reset_registers(s);
    s->tx_pending = false;
    s->tdr_write_accepted = false;
    s->peripheral_reset_asserted = false;
    s->watch_tag = 0;
    if (!s->host_io_blocked) {
        qemu_set_irq(s->irq, 0);
    }
}

static void stm32g474_usart_reset_exit(Object *obj, ResetType type)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(obj);

    s->resetting = false;
    stm32g474_usart_apply_fifo_policy(s);
    stm32g474_usart_update_ack(s);
    stm32g474_usart_update_params(s);
    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
}

static void stm32g474_usart_clock_update(void *opaque, ClockEvent event)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);

    if (!s->handlers_installed || s->host_io_blocked ||
        stm32g474_usart_in_reset(s)) {
        return;
    }

    if (clock_get_hz(s->clk) == 0) {
        stm32g474_usart_cancel_tx_watch(s);
        stm32g474_usart_update_irq(s);
        return;
    }

    stm32g474_usart_update_params(s);
    if (s->tx_pending) {
        stm32g474_usart_try_transmit(s);
    }
    stm32g474_usart_update_irq(s);
    stm32g474_usart_accept_input(s);
}

static int stm32g474_usart_pre_load(void *opaque)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);

    s->host_io_blocked = true;
    stm32g474_usart_cancel_resume(s);
    stm32g474_usart_cancel_tx_watch(s);
    s->tdr_write_accepted = false;
    s->resetting = true;
    return 0;
}

static void stm32g474_usart_resume(void *opaque, bool running,
                                   RunState state)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);
    VMChangeStateEntry *entry;

    if (!running) {
        return;
    }

    entry = s->resume_entry;
    s->resume_entry = NULL;
    if (entry) {
        qemu_del_vm_change_state_handler(entry);
    }

    s->host_io_blocked = false;
    stm32g474_usart_update_irq(s);
    stm32g474_usart_update_params(s);
    if (s->tx_pending) {
        stm32g474_usart_try_transmit(s);
    }
    stm32g474_usart_accept_input(s);
}

static int stm32g474_usart_post_load(void *opaque, int version_id)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(opaque);
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);

    s->host_io_blocked = true;
    stm32g474_usart_cancel_resume(s);
    stm32g474_usart_cancel_tx_watch(s);
    s->watch_tag = 0;
    s->tdr_write_accepted = false;
    for (size_t i = 0; i < variant->num_regs; i++) {
        const RegisterAccessInfo *access = &variant->regs_info[i];
        unsigned int index = access->addr / sizeof(uint32_t);

        s->regs[index] = (s->regs[index] & ~access->rsvd) |
                         (access->reset & access->rsvd);
    }
    stm32g474_usart_apply_fifo_policy(s);
    s->regs[R_RQR] = 0;
    s->regs[R_ICR] = 0;
    if (s->regs[R_PRESC] > 0xb) {
        s->regs[R_PRESC] = 0xb;
    }

    if (s->peripheral_reset_asserted) {
        stm32g474_usart_reset_registers(s);
        s->tx_pending = false;
    } else if (s->tx_pending &&
               (!(s->regs[R_CR1] & R_CR1_UE_MASK) ||
                !(s->regs[R_CR1] & R_CR1_TE_MASK))) {
        s->tx_pending = false;
        s->regs[R_ISR] |= STM32G474_USART_ISR_RESET;
    } else if (s->tx_pending) {
        s->regs[R_ISR] &= ~STM32G474_USART_ISR_RESET;
    }

    stm32g474_usart_update_ack(s);
    s->resetting = false;
    s->resume_entry = qdev_add_vm_change_state_handler(
        DEVICE(s), stm32g474_usart_resume, NULL, s);
    return 0;
}

static const VMStateDescription vmstate_stm32g474_usart = {
    .name = TYPE_STM32G474_USART_BASE,
    .version_id = 1,
    .minimum_version_id = 1,
    .pre_load = stm32g474_usart_pre_load,
    .post_load = stm32g474_usart_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, Stm32g474UsartState,
                             STM32G474_USART_NUM_REGS),
        VMSTATE_BOOL(tx_pending, Stm32g474UsartState),
        VMSTATE_BOOL(peripheral_reset_asserted, Stm32g474UsartState),
        VMSTATE_CLOCK(clk, Stm32g474UsartState),
        VMSTATE_END_OF_LIST()
    },
};

static const Property stm32g474_usart_properties[] = {
    DEFINE_PROP_CHR("chardev", Stm32g474UsartState, chr),
};

static void stm32g474_usart_realize(DeviceState *dev, Error **errp)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(dev);
    const Stm32g474UsartVariant *variant =
        stm32g474_usart_get_variant(s);

    if (!variant || !s->reg_array) {
        error_setg(errp, TYPE_STM32G474_USART_BASE
                   ": concrete variant is missing");
        return;
    }
    if (!clock_has_source(s->clk)) {
        error_setg(errp, TYPE_STM32G474_USART_BASE
                   ": clk clock must be connected");
        return;
    }

    qemu_chr_fe_set_handlers(&s->chr, stm32g474_usart_can_receive,
                             stm32g474_usart_receive, NULL, NULL,
                             s, NULL, true);
    s->handlers_installed = true;
}

static void stm32g474_usart_unrealize(DeviceState *dev)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(dev);

    s->handlers_installed = false;
    stm32g474_usart_cancel_resume(s);
    stm32g474_usart_cancel_tx_watch(s);
    qemu_chr_fe_deinit(&s->chr, false);
}

static void stm32g474_usart_init(Object *obj)
{
    Stm32g474UsartState *s = STM32G474_USART_BASE(obj);
    Stm32g474UsartClass *uc = STM32G474_USART_BASE_GET_CLASS(obj);
    DeviceState *dev = DEVICE(obj);

    g_assert(uc->variant);
    g_assert(uc->variant->num_regs <= STM32G474_USART_NUM_REGS);

    s->reg_array = register_init_block32(
        dev, uc->variant->regs_info, uc->variant->num_regs,
        s->regs_info, s->regs, &stm32g474_usart_ops, false,
        STM32G474_USART_MMIO_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->reg_array->mem);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);
    s->clk = qdev_init_clock_in(dev, "clk", stm32g474_usart_clock_update,
                                s, ClockUpdate);
    qdev_init_gpio_in_named(dev, stm32g474_usart_reset_input, "reset", 1);
}

