zevorn/qemu/hw/char/stm32g474_usart.c
static void stm32g474_usart_base_class_init(ObjectClass *klass,
                                             const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = stm32g474_usart_realize;
    dc->unrealize = stm32g474_usart_unrealize;
    dc->vmsd = &vmstate_stm32g474_usart;
    dc->user_creatable = false;
    device_class_set_props(dc, stm32g474_usart_properties);
    rc->phases.enter = stm32g474_usart_reset_enter;
    rc->phases.hold = stm32g474_usart_reset_hold;
    rc->phases.exit = stm32g474_usart_reset_exit;
}

static void stm32g474_usart_class_init(ObjectClass *klass,
                                        const void *data)
{
    Stm32g474UsartClass *uc = STM32G474_USART_BASE_CLASS(klass);

    uc->variant = &stm32g474_usart_u_variant;
}

static void stm32g474_uart_class_init(ObjectClass *klass,
                                       const void *data)
{
    Stm32g474UsartClass *uc = STM32G474_USART_BASE_CLASS(klass);

    uc->variant = &stm32g474_usart_a_variant;
}

static const TypeInfo stm32g474_usart_types[] = {
    {
        .name = TYPE_STM32G474_USART_BASE,
        .parent = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(Stm32g474UsartState),
        .class_size = sizeof(Stm32g474UsartClass),
        .instance_init = stm32g474_usart_init,
        .class_init = stm32g474_usart_base_class_init,
        .abstract = true,
    }, {
        .name = TYPE_STM32G474_USART,
        .parent = TYPE_STM32G474_USART_BASE,
        .class_init = stm32g474_usart_class_init,
    }, {
        .name = TYPE_STM32G474_UART,
        .parent = TYPE_STM32G474_USART_BASE,
        .class_init = stm32g474_uart_class_init,
    },
};

DEFINE_TYPES(stm32g474_usart_types)
